openfoam/templates/static_thrust/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    propeller
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    outerDomain
    {
        type            calculated;
        value           uniform 0;
    }

    AMI_rotating
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    AMI_static
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}

// ************************************************************************* //
