openfoam/templates/static_thrust/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Air at sea level, 20°C

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0]  1.5e-05;   // kinematic viscosity [m²/s]

// ************************************************************************* //
